app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "タイトル"], ["body", "本文"], ["created_at", "2020-03-23 04:59:27.022365"], ["updated_at", "2020-03-23 04:59:27.022365"]]
---
  def create
      # ↓ストロングパラメーターを使用
      list = List.new(list_params)
      # ↓DBへ保存する
      list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["title", "投稿をすると"], ["body", "詳細ページへ移動します"], ["updated_at", "2020-03-23 05:46:37.725288"], ["id", 1]]
---
  def update
    list = List.find(params[:id])
    list.update(list_params)